Revit 2024 API
ApplicationEntryPoint.CreateRibbonPanel Method
Overload List
Name | Description
CreateRibbonPanel(String) |  (Overrides UIApplication.CreateRibbonPanel(String).)
CreateRibbonPanel(String, String) |  (Overrides UIApplication.CreateRibbonPanel(String, String).)
CreateRibbonPanel(Tab, String) |  (Overrides UIApplication.CreateRibbonPanel(Tab, String).)
See Also
ApplicationEntryPoint Class
ApplicationEntryPoint Members
Autodesk.Revit.UI.Macros Namespace